#include "ui.hpp"

int main() {
    runVfsCLI(); 
    return 0;
    /*
    1-st try:
        можно 1ю лабу объединить со 2й лабой сделав команду cat просто
        b* допилить либо изменить просто использовать b+ готовые решения 
        визуалка не так нужна
        обложить тестами b* дерево вдоль и поперек.


    2-nd try:
        копию делать
        копию делать как люди (1)
        дед
        Нормальное сжатие человеческое
        данные о файле
        сжатие которое будет работать и со спец символами
    */
}
